In [1]:
import numpy as np
import pandas as pd
print('NumPy version: ',np.__version__)
print('Pandas version:',pd.__version__)

NumPy version:  1.26.4
Pandas version: 2.2.1

In [2]:
# For convenience
def make_df(cols, ind):
    """Quickly make a DataFrame"""
    data = {c: [str(c) + str(i) for i in ind] for c in cols}
    return pd.DataFrame(data, ind)

# Example
df = make_df('ABC', range(3))

In [3]:
df

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [4]:
# NumPy concatenate
x = [1, 2, 3]
y = [4, 5, 6]
z = [7, 8, 9]
np.concatenate([x, y, z])

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [5]:
x = [[1, 2],
     [3, 4]]
np.concatenate([x, x], axis=1)

array([[1, 2, 1, 2],
       [3, 4, 3, 4]])

In [6]:
x = [[1, 2],
     [3, 4]]
np.concatenate([x, x], axis=0)

array([[1, 2],
       [3, 4],
       [1, 2],
       [3, 4]])

## Pandas concatenation:
`pd.concat()`

In [7]:
ser1 = pd.Series(['A', 'B', 'C'], index=[1, 2, 3])
ser2 = pd.Series(['D', 'E', 'F'], index=[4, 5, 6])
pd.concat([ser1, ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [8]:
df1 = make_df('AB',[1,2])
df2 = make_df('AB',[3,4])
print(df1)
print(df2)
print(pd.concat([df1,df2]))

    A   B
1  A1  B1
2  A2  B2
    A   B
3  A3  B3
4  A4  B4
    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [9]:
df3 = make_df('CD',[1,2])
print(df3)
print(pd.concat([df1,df3]))
print(pd.concat([df1,df3], axis=1))

    C   D
1  C1  D1
2  C2  D2
     A    B    C    D
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
1  NaN  NaN   C1   D1
2  NaN  NaN   C2   D2
    A   B   C   D
1  A1  B1  C1  D1
2  A2  B2  C2  D2

In [10]:
df4 = make_df('ABC',[1,2])
df5 = make_df('BCD',[3,4])
print(df4)
print(df5)
print(pd.concat([df4,df5]))  #join='outer' - union

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
    B   C   D
3  B3  C3  D3
4  B4  C4  D4
     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

In [11]:
print(pd.concat([df4,df5],join='inner'))  # intersection

    B   C
1  B1  C1
2  B2  C2
3  B3  C3
4  B4  C4

## Pandas merge function

`pd.merge()` implements a subset of *relational algebra*.

It implements 3 types of joins: the *one-to-one*, the *many-to-one* and the *many-to-many* joins.

`pd.merge(df1,df2, on='col_name', how='type_of_join', suffixes=['_x','_y'])`

### Example of US States data

Task: rank the US states and territories by their 2010 population density

In [12]:
pop = pd.read_csv("D:/Python/Project/Machine-Learning/Basic Programming/data/state-population.csv")
areas = pd.read_csv('D:/Python/Project/Machine-Learning/Basic Programming/data/state-areas.csv')
abbrevs = pd.read_csv('D:/Python/Project/Machine-Learning/Basic Programming/data/state-abbrevs.csv')

In [13]:
print(pop.head())
print(areas.head())
print(abbrevs.head())

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0
        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707
        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

In [14]:
state_pop = pd.merge(pop,abbrevs,
                    left_on='state/region', right_on='abbreviation')

# Drop duplicate attribute
state_pop = state_pop.drop('abbreviation',axis=1)
state_pop.head()

  state/region     ages  year  population    state
0           AL  under18  2012   1117489.0  Alabama
1           AL    total  2012   4817528.0  Alabama
2           AL  under18  2010   1130966.0  Alabama
3           AL    total  2010   4785570.0  Alabama
4           AL  under18  2011   1125763.0  Alabama

In [15]:
state_pop.isnull().any()  # To check for any mismatches

state/region    False
ages            False
year            False
population      False
state           False
dtype: bool

In [16]:
state_pop.shape

(2448, 5)

In [17]:
pop_area = pd.merge(state_pop, areas, on='state')
pop_area.head()

  state/region     ages  year  population    state  area (sq. mi)
0           AL  under18  2012   1117489.0  Alabama          52423
1           AL    total  2012   4817528.0  Alabama          52423
2           AL  under18  2010   1130966.0  Alabama          52423
3           AL    total  2010   4785570.0  Alabama          52423
4           AL  under18  2011   1125763.0  Alabama          52423

In [18]:
# Data for 2010
data_2010 = pop_area[(pop_area['year']==2010) & (pop_area['ages']=='total')]
data_2010.head()

    state/region   ages  year  population       state  area (sq. mi)
3             AL  total  2010   4785570.0     Alabama          52423
91            AK  total  2010    713868.0      Alaska         656425
101           AZ  total  2010   6408790.0     Arizona         114006
189           AR  total  2010   2922280.0    Arkansas          53182
197           CA  total  2010  37333601.0  California         163707

In [19]:
data_2010.shape

(51, 6)

In [20]:
# Calculating population density
data_2010.set_index('state',inplace=True)
data_2010.head()

           state/region   ages  year  population  area (sq. mi)
state
Alabama              AL  total  2010   4785570.0          52423
Alaska               AK  total  2010    713868.0         656425
Arizona              AZ  total  2010   6408790.0         114006
Arkansas             AR  total  2010   2922280.0          53182
California           CA  total  2010  37333601.0         163707

In [21]:
density = data_2010['population'] / data_2010['area (sq. mi)']
density.sort_values(ascending=False, inplace=True)
density.head()

state
District of Columbia    8898.897059
New Jersey              1009.253268
Rhode Island             681.339159
Connecticut              645.600649
Massachusetts            621.815538
dtype: float64

## Aggregation and Grouping

Here we will use the Planets dataset. It gives information on extrasolar planets or exoplanets

In [23]:
import seaborn as sns
planets = sns.load_dataset('planets')
planets.shape

(1035, 6)

In [24]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

### Simple aggregation in Pandas

In [26]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.rand(6))
ser

0    0.374540
1    0.950714
2    0.731994
3    0.598658
4    0.156019
5    0.155995
dtype: float64

In [27]:
ser.sum()

2.9679200120443596

In [28]:
ser.mean()

0.4946533353407266

In [29]:
# For DataFrame, by default the aggregates return results within each column

df = pd.DataFrame({'A': rng.rand(3),
                  'B': rng.rand(3)})
df

          A         B
0  0.058084  0.708073
1  0.866176  0.020584
2  0.601115  0.969910

In [30]:
df.sum()

A    1.525375
B    1.698567
dtype: float64

In [31]:
df.mean()

A    0.508458
B    0.566189
dtype: float64

In [32]:
df.max()

A    0.866176
B    0.969910
dtype: float64

In [33]:
df.min()

A    0.058084
B    0.020584
dtype: float64

In [34]:
df.mean(axis=1)

0    0.383078
1    0.443380
2    0.785512
dtype: float64

In [35]:
# Convenience method describe()
planets.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

### **Groupby**: split, apply, combine

In [36]:
df = pd.DataFrame({'key': list('ABCABC'),
                  'data': range(6)})
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [37]:
df.groupby('key')

In [38]:
df.groupby('key').sum()

     data
key
A       3
B       5
C       7

In [39]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [40]:
planets.groupby('method')

In [41]:
planets.groupby('method')['orbital_period']

In [43]:
planets.groupby('method')['orbital_period'].median() 
# general orbital_period (in days) for each of the method

method
Astrometry                         631.180000
Eclipse Timing Variations         4343.500000
Imaging                          27500.000000
Microlensing                      3300.000000
Orbital Brightness Modulation        0.342887
Pulsar Timing                       66.541900
Pulsation Timing Variations       1170.000000
Radial Velocity                    360.200000
Transit                              5.714932
Transit Timing Variations           57.011000
Name: orbital_period, dtype: float64

In [48]:
# Iteration over groups
for (method, group) in planets.groupby('method'):
    print("{0:30s} shape={1}".format(method, group.shape))

Astrometry                     shape=(2, 6)
Eclipse Timing Variations      shape=(9, 6)
Imaging                        shape=(38, 6)
Microlensing                   shape=(23, 6)
Orbital Brightness Modulation  shape=(3, 6)
Pulsar Timing                  shape=(5, 6)
Pulsation Timing Variations    shape=(1, 6)
Radial Velocity                shape=(553, 6)
Transit                        shape=(397, 6)
Transit Timing Variations      shape=(4, 6)

### Aggregate, filter, transform, apply

In [49]:
rng = np.random.RandomState(0)
df = pd.DataFrame({'key': list('ABCABC'),
                  'data1': range(6),
                  'data2': rng.randint(0,10,6)})
df

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

In [53]:
#Aggregate
df.groupby('key').aggregate(['min','median', 'max'])

    data1            data2
      min median max   min median max
key
A       0    1.5   3     3    4.0   5
B       1    2.5   4     0    3.5   7
C       2    3.5   5     3    6.0   9

In [55]:
df.groupby('key').aggregate({'data1': ['mean', 'max'],
                            'data2': 'median'})

    data1      data2
     mean max median
key
A     1.5   3    4.0
B     2.5   4    3.5
C     3.5   5    6.0

In [57]:
# Filtering
def filter_func(x):
    return x['data2'].std() > 3

print(df)
print(df.groupby('key').std())
print(df.groupby('key').filter(filter_func))

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9
       data1     data2
key
A    2.12132  1.414214
B    2.12132  4.949747
C    2.12132  4.242641
  key  data1  data2
1   B      1      0
2   C      2      3
4   B      4      7
5   C      5      9

In [58]:
# Transformation
df.groupby('key').transform(lambda x: x - x.mean())

   data1  data2
0   -1.5    1.0
1   -1.5   -3.5
2   -1.5   -3.0
3    1.5   -1.0
4    1.5    3.5
5    1.5    3.0

In [63]:
# Apply
def norm_by_data2(x):
    x['data1'] /= x['data2'].sum()
    return x

print(df)
print(df.groupby('key').apply(norm_by_data2))

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9
      key     data1  data2
key
A   0   A  0.000000      5
    3   A  0.375000      3
B   1   B  0.142857      0
    4   B  0.571429      7
C   2   C  0.166667      3
    5   C  0.416667      9

C:\Users\Divya Tiwari\AppData\Local\Temp\ipykernel_15016\991265932.py:7: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  print(df.groupby('key').apply(norm_by_data2))

## Vectorised String Operations

In [64]:
data = ['peter','Paul',None, 'MARY','gUIDO']
names = pd.Series(data)
names

0    peter
1     Paul
2     None
3     MARY
4    gUIDO
dtype: object

In [65]:
names.str.capitalize()

0    Peter
1     Paul
2     None
3     Mary
4    Guido
dtype: object

In [66]:
monte = pd.Series(['Graham Chapman', 'John Cleese', 'Terry Gilliam', 
                   'Eric Idle', 'Terry Jones', 'Michael Palin'])

In [67]:
monte.str.len()

0    14
1    11
2    13
3     9
4    11
5    13
dtype: int64

In [68]:
monte.str.startswith('T')

0    False
1    False
2     True
3    False
4     True
5    False
dtype: bool

In [69]:
monte.str.split()

0    [Graham, Chapman]
1       [John, Cleese]
2     [Terry, Gilliam]
3         [Eric, Idle]
4       [Terry, Jones]
5     [Michael, Palin]
dtype: object